import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'iit-study',
  templateUrl: './study.component.html',
  styleUrls: ['./study.component.sass']
})
export class StudyComponent implements OnInit {

  courses = [
    {
      image: '../../../../../assets/images/study_1.png',
      imageDescription: '',
      title: 'Основи вебдоступності',
      // tslint:disable-next-line:max-line-length
      text: 'Тренінг розрахований на керівників бізнесу, проект-менеджерів, вебмайстрів, веб дизайнерів, розробників мобільних аплікацій та всіх зацікавлених осіб, які хотіли б дізнатися що таке вебдоступність і чим корисне її впровадження для інтернет-проектів.',
      link: 'course-osnovy'
    },
    {
      image: '../../../../../assets/images/study_2.png',
      imageDescription: '',
      title: 'Налагодження ефективного робочого процесу з залученням людей з інвалідністю',
      // tslint:disable-next-line:max-line-length
      text: 'Тренінг для вивчення вебдоступності на глибокому рівні. Передбачається, що ваша команда має уявлення про основні принципи вебдоступності. В межах цього тренінгу ви можете обрати з наведених пропозицій один, декілька або всі запропоновані курси, необхідні для роботи саме вашій компанії.',
      link: 'effective-work-process'
    },
    {
      image: '../../../../../assets/images/study_3.png',
      imageDescription: '',
      title: 'Структура та семантика',
      // tslint:disable-next-line:max-line-length
      text: 'Курс дає розуміння особливостей семантичної розмітки, що дозволяє користувачам з обмеженими можливостями читати і переміщатися по сторінках, орієнтирах, заголовках, навігаційних меню, орієнтуватись по посиланнях, таблицях, списках, фреймах, інших елементах веб інтерфейсу.',
      link: 'course-structure'
    },
    {
      image: '../../../../../assets/images/study_4.png',
      imageDescription: '',
      title: 'Не текстовий контент',
      // tslint:disable-next-line:max-line-length
      text: 'Курс спрямований на поліпшення вебдоступності для людей з глибокими порушеннями зору та слуху. Основна частина матеріалів спрямована на адаптацію сайтів для незрячих та людей з порушеннями слуху та зору одночасно.',
      link: 'non-text-content'
    },
    {
      image: '../../../../../assets/images/study_5.png',
      imageDescription: '',
      title: 'Форми, віджети, дінамічний контент',
      // tslint:disable-next-line:max-line-length
      text: 'Курс націлений на створення доступного середовища для всіх користувачів вебінтерфейсу, незалежно від методу користування (миша, клавіатура, тощо). Також зачіпається проблематика допоміжного супроводу користувачів при використанні клієнтського середовища.',
      link: 'dynamic-content'
    },
    {
      image: '../../../../../assets/images/study_6.png',
      imageDescription: '',
      title: 'Засоби тестування контенту',
      // tslint:disable-next-line:max-line-length
      text: 'Курс спрямований на покращення професійних навичок web-accessibility та QA-тестерів. Тут наведені знання про використання інструментів тестування, використанні допоміжних технологій та тонкощі роботи зі стандартами WCAG 2.1.',
      link: 'test-content'
    },
    {
      image: '../../../../../assets/images/study_7.png',
      imageDescription: '',
      title: 'Доступність офісних документів',
      // tslint:disable-next-line:max-line-length
      text: 'В цьому курсі розглядаються питання доступності документів різних форматів: Microsoft Word, Excel, PDF, Fb2, Epub, електронних документів і таблиць від Google та ін. Доступність документів вкрай важлива для того, щоб люди з інвалідністю мали можливість об\'єктивно сприймати наведену інформацію і працювати на рівних засадах зі співробітниками, в разі працевлаштування на підприємство.',
      link: 'accessible-office'
    },
  ];
  constructor() { }

  ngOnInit() {
  }

}
