import { Component, OnInit } from '@angular/core';
import { ActivatedRoute } from '@angular/router';

@Component({
  selector: 'iit-course',
  templateUrl: './course.component.html',
  styleUrls: ['./course.component.sass']
})
export class CourseComponent implements OnInit {
  coursesData = [
    {
      id: 'course-osnovy',
      title: 'Основи вебдоступності',
      // tslint:disable-next-line:max-line-length
      description: 'Тренінг розрахований на керівників бізнесу, проект-менеджерів, вебмайстрів, веб дизайнерів, розробників мобільних аплікацій та всіх зацікавлених осіб, які хотіли б дізнатися що таке вебдоступність і чим корисне її впровадження для інтернет-проектів.',
      modules: [
        ['Що таке вебдоступність, її важливість при розробці сайтів та мобільних аплікацій.'],
        ['Люди та Цифрові технології. Типи інвалідності, допоміжні технології, адаптивні стратегії, принципи універсального дизайну.'],
        ['Бізнес-кейс та переваги. Чому вебдоступність — запорука організації ефективного бізнесу в Інтернеті.'],
        ['Принципи, стандарти та перевірки. Як розуміти принципи стандартів доступності WCAG.'],
        ['Початок роботи з доступністю: стратегії впровадження доступності, ролі, функціональні обов\'язки учасників команди.'],
        ['Межі вебдоступності: який сайт є доступним, кордони доступності, найбільш вразливі елементи вебінтерфейсу.'],
      ],
      results: [
        'Підвищите обізнаність про те, як люди з інвілідністю використовують вебсайти та мобільні аплікації.',
        'Зрозумієте основні концепції та принципи вебдоступності.',
        'Дізнаєтесь про проблеми, які виникають під час реалізації веб-доступності та способи їх вирішення.',
        'Зрозумієте взаємозв\'язок доступності вебаплікацій для налагодження ефективних бізнес-процесів в Інтернеті та багато іншого.'
      ]
    },
    {
      id: 'effective-work-process',
      title: 'Налагодження ефективного робочого процесу з залученням людей з інвалідністю',
      // tslint:disable-next-line:max-line-length
      description: 'Тренінг для вивчення вебдоступності на глибокому рівні. Передбачається, що ваша команда має уявлення про основні принципи вебдоступності. В межах цього тренінгу ви можете обрати з наведених пропозицій один, декілька або всі запропоновані курси, необхідні для роботи саме вашій компанії.',
      modules: [
        ['Співпраця з людьми з інвалідністю: коли це доцільно і де краще підбирати необхідний персонал.'],
        ['Як співпрацювати в одній команді з людьми з інвалідністю.',
        'Мова толерантності (наприклад, чому не можна казати "вади зору" в публічному спілкуванні).',
        'Оцінка доступності менеджера задач та інших онлайн-засобів командної роботи.'
        ],
        [
          'Типи інвалідності та вебдоступність.',
          // tslint:disable-next-line:max-line-length
          'Особливості користування інтернет-ресурсами та програмним забезпеченням людьми з порушеннями зору, слуху, опорно-рухового апарату, психічними, когнітивними, сенсорними порушеннями.'
        ],
        // tslint:disable-next-line:max-line-length
        ['Програми зчитування з екрану (скрінрідери( - NVDA, JAWS, VoiceOver, TalkBack для Android. Їх роль при тестуванні сайтів та мобільних аплікацій.'],
      ],
      results: [
        'Підвищите обізнаність про те, як люди з інвілідністю використовують веб-сайти та мобільні аплікації.',
        'Зрозумієте основні концепції та принципи веб-доступності.',
        'Дізнаєтесь про проблеми, які виникають під час реалізації веб-доступності та способи їх вирішення.',
        'Зрозумієте взаємозв\'язок доступності веб аплікацій для налагодження ефективних бізнес-процесів в Інтернеті та багато іншого.'
      ]
    },
    {
      id: 'course-structure',
      title: 'Структура та семантика',
      // tslint:disable-next-line:max-line-length
      description: 'Курс дає розуміння особливостей семантичної розмітки, що дозволяє користувачам з інвалідністю читати і переміщатися по сторінках, орієнтирах, заголовках, навігаційних меню, орієнтуватись по посиланнях, таблицях, списках, фреймах, інших елементах вебінтерфейсу.',
      modules: [
        ['Title сторінки: значення для вебдоступності, особливості сприйняття програмами зчитування з екрану.'],
        ['Мова та вебдоступність. Значення мови сайту та окремих частин сторінки.'],
        // tslint:disable-next-line:max-line-length
        ['Орієнтири (landmarks) - правильна розмітка HTML5 ARIA та best practices.', 'Навігація по орієнтирам за допомогою програм зчитування з екрану.'],
        ['Заголовки та їх семантична ієрархія. Навігація по заголовкам за допомогою програм зчитування з екрану.'],
        ['Меню та навігація (навігаційні списки, посилання, фокус, тощо). Особливості навігації по сторінці та між сторінками сайту.'],
        // tslint:disable-next-line:max-line-length
        ['Таблиці. Правильна семантична розмітка табличних даних, особливості навігації по таблицям за допомогою програм зчитування з екрану.'],
        // tslint:disable-next-line:max-line-length
        ['Списки, фрейми, інші семантичні елементи (цитати, шрифти, тощо). Значення правильного застосування HTML-тегів елементів для вебдоступності.'],
        ['Валідність коду та застаріла розмітка. Можливі проблеми при провадженні вебдоступності.']
      ],
      results: []
    },
    {
      id: 'non-text-content',
      title: 'Не текстовий контент',
      // tslint:disable-next-line:max-line-length
      description: 'Курс спрямований на поліпшення вебдоступності для людей з глибокими порушеннями зору та слуху. Основна частина матеріалів спрямована на адаптацію сайтів для незрячих та людей з порушеннями слуху та зору одночасно.',
      modules: [
        ['Зображення. Пойняття альт-тексту, особливості доступності декоративних зображень, кнопок, посилань, елементів керування.'],
        ['Анімації та слайдери.'],
        ['Складні зображення, зображення тексту та фони CSS.'],
        ['Графічні карти, діаграми, розширені описи, ілюстративний живопис.'],
        ['SVG (векторна графіка) : методи адаптації, контрасність.'],
        ['Значки и шрифти.'],
        ['HTML5 Canvas. Особливості адаптації для роботи людей з низьким зором та впровадження доступності з клавіатури.'],
        ['Доступність мультимедіа (відео, аудіо, Silverlight, Flash та ін).'],
      ],
      results: []
    },
    {
      id: 'dynamic-content',
      title: 'Форми, віджети, дінамічний контент',
      // tslint:disable-next-line:max-line-length
      description: 'Курс націлений на створення доступного середовища для всіх користувачів вебінтерфейсу, незалежно від методу користування (миша, клавіатура, тощо). Також зачіпається проблематика допоміжного супроводу користувачів при використанні клієнтського середовища.',
      modules: [
        ['Форми та елементи вводу: особливості коду, валідація, попередження помилок.'],
        // tslint:disable-next-line:max-line-length
        ['Віджети та взаємодія.', 'Адаптація доступності користувальницьких JavaScript / ARIA віджетів.', 'Важливі моменти при взаємодії віджетів та клавіатури.'],
        ['Часові рамки (обмежений сеанс, time-out, оновлення контенту).'],
        ['Динамічний контент.', 'Перезавантаження контенту.', 'Нескінченна прокрутка.', 'AJAX.'],
        ['Інструкції та зворотній зв\'язок.', 'Супровід користувача при роботі з вебінтерфейсом.'],
      ],
      results: []
    },
    {
      id: 'test-content',
      title: 'Засоби тестування контенту',
      // tslint:disable-next-line:max-line-length
      description: 'Цей курс спрямований на покращення професійних навичок web-accessibility та QA-тестерів. Тут наведені знання про використання інструментів тестування, використанні допоміжних технологій та тонкощі роботи зі стандартами WCAG 2.1.',
      modules: [
        ['Засоби тестування. Використання онлайн-чекерів та програмного забезпечення для автоматичного та ручного тестування.'],
        ['Ассистивні технології. Робота зі скрін рідерами та спеціальними можливостями операційних систем.'],
        ['WCAG - tips and tricks. Огляд стандартів WCAG 2.1, корисні поради по використанню технік WCAG для тестувальників.'],
      ],
      results: []
    },
    {
      id: 'accessible-office',
      title: 'Доступність офісних документів',
      // tslint:disable-next-line:max-line-length
      description: 'В цьому курсі розглядаються питання доступності документів різних форматів: Microsoft Word, Excel, PDF, Fb2, Epub, електронних документів і таблиць від Google та ін. Доступність документів вкрай важлива для того, щоб люди з інвалідністю мали можливість об\'єктивно сприймати наведену інформацію і працювати на рівних засадах зі співробітниками, в разі працевлаштування на підприємство.',
      modules: [
        ['Доступність документів MS-Word.'],
        ['Доступність документів MS-Excel.'],
        ['Доступність презентацій Powerpoint.'],
        ['Доступність формату PDF.', 'PDF та скрінрідери.'],
        ['Доступність електронних книг (Fb2, Epub, HTML).'],
        ['Доступність документів аплікацій Google: документи, таблиці, презентації.'],
      ],
      results: []
    },
  ];

  currentCourse: any;

  constructor(private route: ActivatedRoute) {}

  ngOnInit() {
    const currentCourseId = this.route.snapshot.paramMap.get('id');
    this.currentCourse = this.coursesData.find((course: any) => course.id === currentCourseId);
  }
}
